Autodesk.Revit.DB.PlanViewDirection
This enumerated type represents the possible directions for a plan view.
Since:
2013

Autodesk.Revit.DB.PlanViewDirection.Up
Revit looks up to the plan view

Autodesk.Revit.DB.PlanViewDirection.Down
Revit looks down onto the plan view

Autodesk.Revit.DB.PlanViewDirection.Undefined
View does not use Plan View Direction